app/Providers/AppServiceProvider.php

    public function boot()
    {
        //
        Schema::defaultStringLength(191);

        //左侧菜单
        view()->composer('home.layout',function($view){
            $menus = \App\Models\Permission::with([
                'childs'=>function($query){$query->with('icon');}
                ,'icon'])->where('parent_id',0)->orderBy('sort','desc')->get();
            $unreadMessage = \App\Models\Message::where('read',1)->where('accept_id',auth()->user()->id)->count();
---
select * from `icons` where `icons`.`id` in (12, 121, 123)
select * from `permissions` where `parent_id` = 0 order by `sort` desc
select count(*) as aggregate from `messages` where `read` = 1 and `accept_id` = 1