app/Http/Controllers/Admin/IndexController.php

select * from `icons` where `icons`.`id` in (100)
select * from `permissions` where `parent_id` = 0 limit 10 offset 0
select `users`.`id` as `id`, `users`.`name` as `name`, `users`.`phone` as `phone`, `users`.`email` as `email`, `roles`.`display_name` as `role_name`, `users`.`created_at` as `created_at`, `users`.`check` as `check` from `users` left join `roles` on `users`.`role_id` = `roles`.`id` limit 10 offset 0
select count(*) as aggregate from `permissions` where `parent_id` = 0
---
    public function data(Request $request)
    {
        $model = $request->get('model');
        switch (strtolower($model)) {
            case 'user':
                $query = new User();
                if ($request->has('name') || $request->has('email') || $request->has('role_id')) {
                    $query = $query->orWhere(array('users.name' => $request->input('name'), 'users.email' => $request->input('email'), 'users.role_id' => $request->input('role_id')));
                }
                $query = $query->leftJoin('roles', 'users.role_id', '=', 'roles.id')
                    ->select('users.id as id', 'users.name as name', 'users.phone as phone', 'users.email as email', 'roles.display_name as role_name', 'users.created_at as created_at', 'users.check as check');
                break;
            case 'role':
                $query = new Role();
                break;
            case 'permission':
                $query = new Permission();
                $query = $query->where('parent_id', $request->get('parent_id', 0))->with('icon');
                break;
            default:
                $query = new User();
                break;
        }
        $res = $query->paginate($request->get('limit', 30))->toArray();