app/Http/Controllers/Admin/PermissionController.php

    public function index()
    {
        //显示顶级权限
        $permission = Permission::where('parent_id', '0')->get();
---
select * from `permissions` where `parent_id` = '0'