app/Http/Controllers/Admin/UserController.php

select * from `roles`
---
    public function index()
    {
        $role = Role::get();